#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Fri Jun  9 16:09:31 2023

add_design "C:/Users/w/Desktop/11_ethernet_test/source/arp_cache.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/arp_mac_top.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/arp_rx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/arp_tx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/check_sum.vh"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/crc32_gen.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/eth_udp_test.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/ethernet_test.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/icmp.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/ip_layer.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/ip_rx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/ip_tx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/ip_tx_mode.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/mac_arp_test.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/mac_layer.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/mac_rx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/mac_tx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/mac_tx_mode.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/rgmii_interface.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/rgmii_test.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/udp_ip_mac_top.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/udp_layer.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/udp_rx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/udp_rx_bac.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/udp_tx.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/arp_cache.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/arp_mac_top.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/arp_rx.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/arp_tx.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/crc32_gen.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/mac_arp_test.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/mac_layer.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/mac_rx.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/mac_tx.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/mac_tx_mode.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/rgmii_interface.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/rgmii_test.v"
remove_design -force -verilog "C:/Users/w/Desktop/11_ethernet_test/source/udp_rx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/rgmii_interface.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/arp_mac_top.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/arp_cache.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/arp_rx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/arp_tx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/mac_layer.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/mac_rx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/mac_tx.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/mac_tx_mode.v"
add_design "C:/Users/w/Desktop/11_ethernet_test/source/crc32_gen.v"
remove_design -verilog "C:/Users/w/Desktop/11_ethernet_test/source/check_sum.vh"
add_design C:/Users/w/Desktop/11_ethernet_test/ipcore/ref_clock/ref_clock.idf
add_design "C:/Users/w/Desktop/11_ethernet_test/source/check_sum.vh"
add_design C:/Users/w/Desktop/11_ethernet_test/ipcore/icmp_rx_ram_8_256/icmp_rx_ram_8_256.idf
add_design C:/Users/w/Desktop/11_ethernet_test/ipcore/udp_shift_register/udp_shift_register.idf
add_design "C:/Users/w/Desktop/11_ethernet_test/source/udp_rx.v"
remove_design -verilog "C:/Users/w/Desktop/11_ethernet_test/source/udp_rx_bac.v"
add_constraint "C:/Users/w/Desktop/11_ethernet_test/ethernet_test.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
add_fic "C:/Users/w/Desktop/MES50HP/MES50HP/MES50HP_v2/2_Demo/11_ethernet_test/synthesize/ethernet_test_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force E:/Board/MES50HP/MES50HP/MES50HP_v2/2_Demo/11_ethernet_test/ipcore/ref_clock/ref_clock.idf
add_design "E:/Board/MES50HP/MES50HP/MES50HP_v2/2_Demo/11_ethernet_test/source/ethernet_test_top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design E:/Board/MES50HP/MES50HP/MES50HP_v2/2_Demo/11_ethernet_test/ipcore/rgmii_clk/rgmii_clk.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force -verilog "E:/Board/MES50HP/MES50HP/MES50HP_v3/2_Demo/11_ethernet_test/ethernet1_test/source/ethernet_test_top.v"
remove_design -force E:/Board/MES50HP/MES50HP/MES50HP_v3/2_Demo/11_ethernet_test/ethernet1_test/ipcore/rgmii_clk/rgmii_clk.idf
remove_fic "E:/Board/MES50HP/MES50HP/MES50HP_v3/2_Demo/11_ethernet_test/ethernet1_test/synthesize/ethernet_test_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet1_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet1_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet1_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design E:/Board/MES50HP/MES50HP/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/ref_clock/ref_clock.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet1_test
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "E:/Board/MES50HP/MES50HP/MES50HP_v3/2_Demo/11_ethernet_test/synthesize/ethernet_test_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic -force"E:/Board/MES50HP/MES50HP/MES50HP_v3/2_Demo/11_ethernet_test/synthesize/ethernet_test_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/adda.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
remove_design -verilog "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/adda.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/adda.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/ad_clock_125m/ad_clock_125m.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module adda
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/synthesize/top_syn.fic"
dev_map 
dev_map 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic -force"E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/synthesize/top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/synthesize/top_syn.fic"
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/6_IP_setup_packet/DDR3/ram_ad_data
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/6_IP_setup_packet/DDR3/ram_ad_data
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/fifo_buffer/fifo_buffer.idf
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/adc_capture.v"
remove_design -verilog "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/adc_capture.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/adc_capture.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/ddr_test/ddr_test.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/ddr_example.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
remove_design -verilog "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/ddr_example.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/test_ddr.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/ddr_ctrl.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/tb_ddr3.v"
remove_design -verilog "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/tb_ddr3.v"
add_simulation "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/tb_ddr3_simu.v"
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module test_ddr
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module test_ddr
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module test_ddr
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module ethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/video_capture.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/btn_deb_fix.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/function_switch.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/key_ct1.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/end_fifo/end_fifo.idf
remove_design -force E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/end_fifo/end_fifo.idf
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/sig_ethernet_fifo/sig_ethernet_fifo.idf
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/fifo_ethernet/fifo_ethernet.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
remove_design -force -verilog "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/adc_capture.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
remove_design -verilog "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/ethernet_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/ms72xx_pll/ms72xx_pll.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/ms72xx/iic_dri.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/ms72xx/ms72xx_ctl.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/ms72xx/ms7200_ctl.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/ms72xx/ms7210_ctl.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/fifo_32bit_convert/fifo_32bit_convert.idf
remove_design -force E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/fifo_32bit_convert/fifo_32bit_convert.idf
remove_design -force E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/fifo_ethernet/fifo_ethernet.idf
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/hdmi_fifo/hdmi_fifo.idf
add_design E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/eth_fifo/eth_fifo.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/source/hdmi/video_zoom.v"
add_design "E:/DELL/Desktop/FPGA/FPGA_DevelopKnit/MES50HP_v3/2_Demo/11_ethernet_test/ipcore/ram/interpolation_ram.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
