#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Thu Oct 31 18:32:01 2024

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
pnr -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
pnr -optimize_multi_corner_timing -fix_hold_violation 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module test_ddr
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
